'use strict'

// Завдання 1

let age=prompt('Скільки Вам років?');
let def=(age<12) ? 'Ви дитина' :
        (age<18) ? 'Ви підліток' :
        (age<60) ? 'Ви дорослий' :
                   'Ви пенсіонер';
alert(def); 


// ***********************************************
// Завдання 2

// const nam=+prompt('Введіть число від 0 до 9');
// let rez;
// switch(nam){
//     case 1: rez='!'; break;
//     case 2: rez='@'; break;
//     case 3: rez='#'; break;
//     case 4: rez='$'; break;
//     case 5: rez='%'; break;
//     case 6: rez='^'; break;
//     case 7: rez='&'; break;
//     case 8: rez='*'; break;
//     case 9: rez='('; break;
//     case 0: rez=')'; break;
//     default: rez='Введено невірно'
// }
// alert(rez);


// ***********************************************
// Завдання 3

// let nam=+prompt('Введіть тризначне число');
// let a=Math.floor(nam/100);
// let c=nam%10;
// let b=(nam%100-c)/10;
// let rez = a==b || a==c || b==c ? 'В цьому числі є однакові цифри' : 'В цьому числі немає однакових цифр';
// alert(rez);


// ***********************************************
// Завдання 4

// let year=+prompt('Введіть рік');
// let rez = (year%4==0 && year%100!==0) || year%400==0 ? 'Цей рік високосний.' : 'Цей рік не високосний.'
// alert(rez);


// ***********************************************
// Завдання 5

// let nam=+prompt('Введіть п\'ятирозрядне число, щоб дізнатися чи є це число паліндромом.');
// let a=nam%100==Math.floor(nam/1000) ? 'Паліндром' : 'Не паліндром';
// alert(a);


// ***********************************************
// Завдання 6

// let usd=+prompt('Скільки долларів Ви бажаєте обміняти?');
// let choice=prompt(`Вибіріть в яку валюту хоче перекласти: EUR, UAN
// або AZN`);
// let rez;
// switch(choice){
//     case 'EUR': rez=usd*0.95; break;
//     case 'UAN': rez=usd*38; break;
//     case 'AZN': rez=usd*2; break;
//     default: rez='Введено невірно'
//     alert(rez);
// }
// alert('Ви отримаєте суму - '+rez.toFixed(2));


// ***********************************************
// Завдання 7

// let sum=+prompt('Введіть суму покупки');
// let rez;
// if(sum<200)
// rez=sum;
// else if(sum<300)
// rez=sum*0.97;
// else if(sum<500)
// rez=sum*0.95;
// else
// rez=sum*0.93;
// alert(`Сума до сплати складає - ${rez.toFixed(2)} грн.`);


// ***********************************************
// Завдання 8

// let a=+prompt('Введть довжину кола');
// let b=+prompt('Введть периметр квадрату');
// if(a/Math.PI<b/4)
// alert('Таке коло поміститься у квадрат');
// else
// alert('Таке коло не поміститься у квадрат');


// ***********************************************
// Завдання 9

// let a=+prompt('Скільки буде 2+2. Варіант 1 = 4. Варіант 2 = 1. Варіант 3 = 2.');
// let b=+prompt('Скільки буде 1+1. Варіант 1 = 4. Варіант 2 = 1. Варіант 3 = 2.');
// let c=+prompt('Скільки буде 2-1. Варіант 1 = 4. Варіант 2 = 1. Варіант 3 = 2.');
// if(a==1) a=2; else a=0;
// if(b==3) b=2; else b=0;
// if(c==2) c=2; else c=0;
// let rez=a+b+c;
// alert('Кількість набраних балів - '+rez);


// ***********************************************
// Завдання 10

// let day=+prompt('Введіть поточне число');
// let month=+prompt('Введіть поточний місяць');
// let year=+prompt('Введіть поточний рік');
// if((month==1 || month==3 || month==5 || month==7 || month==8 || month==10 || month==12) && (day==31)){
//     day=1;
//     month++;
//     }
// else if((month==4 || month==6 || month==9 || month==11) && (day==30)){
//     day=1;
//     month++;
//     }
// else if(month==2 && ((day==28 && !((year%4==0 && year%100!==0) || year%400==0)) || day==29)){
//     day=1;
//     month++;
//     }
// else day++;
// if (month==13){
//     month=1;
//     year++;
// }
// alert(`Завтра буде ${day.toString().padStart(2, '0')}.${month.toString().padStart(2, '0')}.${year}`);